lutaml/ManagedConcepts.dot
digraph G {
  graph [splines="ortho" pad=0.5 ranksep="1.2.equally" nodesep="1.2.equally"]
  edge [color="gray50"]
  node [shape="box" fontname="Helvetica-bold"]

  ManagedConceptCollection [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ManagedConceptCollection</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+concepts : ManagedConcept &#91;0..*&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  ManagedConcept [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ManagedConcept</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+related : RelatedConcept &#91;0..*&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+status : ConceptStatus</TD></TR>
            <TR><TD ALIGN="LEFT">+dates : ConceptDate &#91;0..*&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+localizedConcepts : LocalizedConcept &#91;0..1&#93;</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  RelatedConcept [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>RelatedConcept</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  LocalizedConcept [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>LocalizedConcept</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+language : Iso639ThreeCharCode</TD></TR>
            <TR><TD ALIGN="LEFT">+script : Iso15924Code &#91;0..1&#93;</TD></TR>
            <TR><TD ALIGN="LEFT">+concept : Concept</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  Concept [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>Concept</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  ConceptDate [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ConceptDate</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">+date : Iso8601Date</TD></TR>
            <TR><TD ALIGN="LEFT">+type : ConceptDateType</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  ConceptStatus [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ConceptStatus</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">draft</TD></TR>
            <TR><TD ALIGN="LEFT">notValid</TD></TR>
            <TR><TD ALIGN="LEFT">valid</TD></TR>
            <TR><TD ALIGN="LEFT">superseded</TD></TR>
            <TR><TD ALIGN="LEFT">retired</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  ConceptDateType [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>ConceptDateType</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
              <TR><TD ALIGN="LEFT">accepted</TD></TR>
            <TR><TD ALIGN="LEFT">amended</TD></TR>
            <TR><TD ALIGN="LEFT">retired</TD></TR>
  </TABLE>
        </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]
  
  RelatedConceptType [shape="plain" fontname="Helvetica" label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" CELLPADDING="10">
    <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="CENTER"><B>RelatedConceptType</B></TD></TR>
  </TABLE>
  </TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  <TR>
    <TD><TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0">
    <TR><TD ALIGN="LEFT"></TD></TR>
  </TABLE></TD>
  </TR>
  
  </TABLE>
  >]

  LocalizedConcept -> ManagedConcept [dir="direct" arrowtail="onormal" arrowhead="vee"]
  ConceptStatus -> ManagedConcept [dir="direct" arrowtail="onormal" arrowhead="vee"]
  ConceptDate -> ManagedConcept [dir="direct" arrowtail="onormal" arrowhead="vee"]
  RelatedConcept -> ManagedConcept [dir="direct" arrowtail="onormal" arrowhead="vee"]
  ConceptDateType -> ConceptDate [dir="direct" arrowtail="onormal" arrowhead="vee"]
  RelatedConceptType -> RelatedConcept [dir="direct" arrowtail="onormal" arrowhead="vee"]
  LocalizedConcept -> Concept [dir="direct" arrowtail="onormal" arrowhead="onormal"]
}
